app/Http/Controllers/tinTucController.php

    public function index()
    {
        // $tin = tin::get(['tieuDe', 'noiDung', 'created_at'])
        //     ->sortByDesc('created_at')->take(10);

        $tin = DB::table('tin')
            ->select('tieuDe', 'noiDung', 'created_at')
            ->orderBy('created_at', 'desc')
            ->limit(10)
            ->get();
---
select `tieuDe`, `noiDung`, `created_at` from `tin`

    public function tintrongloai(String $idCategory)
    {
        // $tintuc = tinTuc::where('category_id', $idCategory)->get();
        // $tintuc_category = tinTucCategory::findOrFail($idCategory);

        // Fetch tin_tuc items by category_id
        $tintuc = DB::table('tin')
            ->where('category_id', '=', $idCategory)
            ->get();
---
select * from `tin` where `category_id` = '1'